HELP_INFO = 'Игра "Интеллектуальный олимп" рассчитана на проверку вашей эрудиции. Я задаю вам вопросы, а вы на них отвечаете. ' \
     'Чем больше у вас очков, тем выше ваше место в рэйтинге игроков! Всё очень просто.\n'


FULL_HELP_INFO = 'Игра "Интеллектуальный олимп" рассчитана на проверку вашей эрудиции. Я задаю вам вопросы, а вы на них отвечаете. ' \
     'Чем больше у вас очков, тем выше ваше место в рэйтинге игроков! Если вы ошибаетесь, то ваши очки сгорают и игра ничинается заного. В любой момент скажите' \
                 '"Стоп", тогда мы запишим ваш результат в рэйтинг игры "Интеллектуальный олимп"!\n'


WRONG_NAME = ['Я не расслышала ваше имя, повторите пожалуйста.',
              'Простите, но я не расслышала ваше имя, повторите пожалуйста.',
              'Повторите пожалуйста ваше имя.',
              'Не могли бы вы повторить ваше имя?',
              'Пожалуйста, повторите ваше имя.'
              ]


CHOOSE_CATEGORY = ['{}, выберите категорию вопросов.']


WE_HAVENT_QUESTION_IN_THIS_CATEGORY = 'Увы, но у нас для вас нет вопросов из данной категории, выберите другую.'


BAD_CHANGE_CATEGORY = 'Простите, я не совсем поняла какую категорию вы выбрали, повторите её ещё раз.\n'

GOOD_ANSWER = [
    'И это правильный ответ!',
    'Великолепно! Это действительно верный ответ!',
    'Хочу вас огорчить, но это ... правильный ответ!',
    'И это... правильный ответ!',
    'Поздравляю вас, это правильный ответ!',
    'Ну, конечно, это правильный ответ!',
    'Ну, а что ещё? Конечно, это правильный ответ!',
    'Вы ответили правильно!',
    'Как тут можно сомневаться? Это правильный ответ!',
    'У меня нет слов, это правильный ответ!',
    'Поразительно, но это правильный ответ!'
]


GAME_OVER = ['Увы, но это неверный ответ. В следующий раз вам обязательно повезёт!',
             'К сожалению, это неправильный ответ.  В следующий раз вам обязательно повезёт!',
             'И это... неправильный ответ, жаль, но на этом игра оканчивается.',
             'Увы, но это неверный ответ. В следующий раз вам обязательно повезёт!',
             'Это неправильный ответ, вы хорошо шли.'
             ]

REFUSAL_TIP  = ['не надо', 'не нужна', 'отказыв']

WITHOUT_PROMPT = [
    'Хорошо, отвечайте без подсказок.',
    'Без подсказок, так без подсказок.'
    ]


EXTRA_LIFE = [
    'доп.жизнь',
    'дополнительная жизнь',
    'дополнительн',
    'доп жизнь',
    'доп. жизнь',
]


FIFTY_FIFTY = [
    '50 на 50',
    'пятдесят',
    'пятд',
    '50на50'
]


CALL_TO_FRIEND = [
    'звонок дру',
    'другу звон',
    'позвоню дру',
    'другу',
    'друга'
]



TIME_ENDED = [
    'Время на обсуждение вопроса закончилось, пора делать свой выбор!',
    'Время подошло к концу, пора делать выбор!',
    'Время вышло! Пора определиться с ответом!',
    'Одна минута прошла, нужно выбрать ответ!'
    ]


HELP_HALL = [
    'помощь зала',
    'зал помоги',
    'зал',
    'зритель'
]

TOP_WORDS = [
    'топ-лист',
    'топ игроков',
    'рэйт',
    'топ игроков',
    'топ лист',
    'посмотреть'
]


CHANGE_CATEGORY_WORDS = [
    'сменить категорию',
    'сменить',
    'поменять',
    'смени'
]

STAY_AT_THIS_CATEGORY = [
    'остаться',
    'остаться в текущей категории',
    'останусь'
]


STOP_WORDS = [
    'стоп',
    'остановись',
    'стоп'
]
